### Quartile Q1 (First Quartile)
#### Definition:
#### The first quartile (Q1) is the value that separates the lowest 25% of the data from the rest. It represents the 25th percentile of the dataset.
#### Formula:
$Q1 = \frac{1}{4}(n + 1)^{th} \text{ value}$

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
data = {
    'Age': [22, 25, 30, 28, 35, 40, 27, 23, 31, 29],
    'Salary': [25000, 30000, 40000, 38000, 50000, 55000, 42000, 31000, 45000, 39000],
    'Department': ['HR', 'Finance', 'IT', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT']
}

In [10]:
df = pd.DataFrame(data)

In [12]:
df

   Age  Salary Department
0   22   25000         HR
1   25   30000    Finance
2   30   40000         IT
3   28   38000         IT
4   35   50000         HR
5   40   55000    Finance
6   27   42000         IT
7   23   31000         HR
8   31   45000    Finance
9   29   39000         IT

## Q1

In [15]:
df["Salary"].quantile(0.25) # 25th Percentile

32750.0

### Quintile
#### Definition:
#### Quintiles divide the data into five equal parts, each containing 20% of the observations.
#### Each quintile represents a cutoff point separating 20%, 40%, 60%, 80%, and 100% of the data.
#### Formula:
$Q_k = \frac{k(n + 1)}{5} \text{th value}$
#### where
#### n = total number of observations
#### k = 1, 2, 3, 4 (for the 1st to 4th quintiles)

In [18]:
df

   Age  Salary Department
0   22   25000         HR
1   25   30000    Finance
2   30   40000         IT
3   28   38000         IT
4   35   50000         HR
5   40   55000    Finance
6   27   42000         IT
7   23   31000         HR
8   31   45000    Finance
9   29   39000         IT

## Q2

In [21]:
df["Salary"].quantile(0.50)  # 50th Percentile

39500.0

### Decile
#### Definition:
#### Deciles divide the data into ten equal parts, each representing 10% of the observations.
#### Each decile marks a cutoff point separating 10%, 20%, 30%, and so on up to 100% of the data.
#### Formula:
$D_k = \frac{k(n + 1)}{10} \text{th value}$
#### where
#### n = total number of observations
#### k = 1, 2, 3, â€¦, 9 (for the 1st to 9th decile)

In [24]:
df

   Age  Salary Department
0   22   25000         HR
1   25   30000    Finance
2   30   40000         IT
3   28   38000         IT
4   35   50000         HR
5   40   55000    Finance
6   27   42000         IT
7   23   31000         HR
8   31   45000    Finance
9   29   39000         IT

## Q3

In [27]:
df["Salary"].quantile(0.75)  # 75th Percentile

44250.0

### Interquartile Range (IQR)
#### Definition:
#### The Interquartile Range (IQR) measures the spread of the middle 50% of the data.
#### It is the difference between the third quartile (Q3) and the first quartile (Q1).
#### Formula:

$IQR = Q3 - Q1$

In [43]:
# Q1 

df["Salary"].quantile(0.25)

32750.0

In [37]:
# Q3

df["Salary"].quantile(0.75)

44250.0

In [45]:
# IQR = Q3-Q1

df["Salary"].quantile(0.75)-df["Salary"].quantile(0.25)

11500.0